# Join exercises
Solve exercise 1 to 4 in this notebook.

Run the following cells to prepare a database with data.

In [25]:
!rm cars.sqlite

In [26]:
import sqlite3
import pandas
conn = sqlite3.connect('cars.sqlite')
c = conn.cursor()

In [27]:
people = '''
CREATE TABLE IF NOT EXISTS people (
    id INT NOT NULL,
    name STRING NOT NULL,
    PRIMARY KEY(Id)
)
'''
c.execute(people)
conn.commit()

In [28]:
people_rows = '''
INSERT INTO people (id, name) VALUES 
    (1, 'John'),
    (2, 'Pat'),
    (3, 'Michael'),
    (4, 'Scott'),
    (5, 'Jason'),
    (6, 'Jane'),
    (7, 'Miranda'),
    (8, 'Simon')
'''
c.execute(people_rows)
conn.commit()

In [29]:
cars = '''
CREATE TABLE IF NOT EXISTS cars (
    people_id INT,
    car STRING NOT NULL,
    license STRING NOT NULL
)
'''
c.execute(cars)
conn.commit()

In [30]:
cars_rows = '''
INSERT INTO cars (people_id, car, license) VALUES 
    (1, 'Ford Escort', 'AB 12345'),
    (3, 'Ford Escort', 'CD 98765'),
    (1, 'Porsche 911', 'QW 13578'),
    (6, 'Fiat Multipla', 'MORS DYT'),
    (2, 'VW Golf GTI', 'AA 99999'),
    (5, 'VW Polo', 'BB 74873'),
    (4, 'Opel Kadett', 'TT 12345'),
    (0, 'Mercedes', 'ZZ 76345'),
    (1, 'Audi R8', 'QQ 23897')
'''
c.execute(cars_rows)
conn.commit()

If things went right, you should see two tables, `people` and `cars`, in the output from the following cells. You will query these in the exercises.

In [31]:
import pandas
c.execute('SELECT * FROM people')
pandas.DataFrame(c.fetchall(), columns=['id', 'name'])

   id     name
0   1     John
1   2      Pat
2   3  Michael
3   4    Scott
4   5    Jason
5   6     Jane
6   7  Miranda
7   8    Simon

In [36]:
c.execute('SELECT * FROM cars')
pandas.DataFrame(c.fetchall(), columns=['people_id', 'car', 'license'])

   people_id            car   license
0          1    Ford Escort  AB 12345
1          3    Ford Escort  CD 98765
2          1    Porsche 911  QW 13578
3          6  Fiat Multipla  MORS DYT
4          2    VW Golf GTI  AA 99999
5          5        VW Polo  BB 74873
6          4    Opel Kadett  TT 12345
7          0       Mercedes  ZZ 76345
8          1        Audi R8  QQ 23897

In [42]:
c.execute('SELECT * FROM cars')
c.fetchall()

[(1, 'Ford Escort', 'AB 12345'),
 (3, 'Ford Escort', 'CD 98765'),
 (1, 'Porsche 911', 'QW 13578'),
 (6, 'Fiat Multipla', 'MORS DYT'),
 (2, 'VW Golf GTI', 'AA 99999'),
 (5, 'VW Polo', 'BB 74873'),
 (4, 'Opel Kadett', 'TT 12345'),
 (0, 'Mercedes', 'ZZ 76345'),
 (1, 'Audi R8', 'QQ 23897')]

In [43]:
c.execute('SELECT * from people')
c.fetchall()

[(1, 'John'),
 (2, 'Pat'),
 (3, 'Michael'),
 (4, 'Scott'),
 (5, 'Jason'),
 (6, 'Jane'),
 (7, 'Miranda'),
 (8, 'Simon')]

In [51]:
c.execute('SELECT people_id, name, car, license FROM cars INNER JOIN people on cars.people_id = people.id')
c.fetchall()

[(1, 'John', 'Ford Escort', 'AB 12345'),
 (3, 'Michael', 'Ford Escort', 'CD 98765'),
 (1, 'John', 'Porsche 911', 'QW 13578'),
 (6, 'Jane', 'Fiat Multipla', 'MORS DYT'),
 (2, 'Pat', 'VW Golf GTI', 'AA 99999'),
 (5, 'Jason', 'VW Polo', 'BB 74873'),
 (4, 'Scott', 'Opel Kadett', 'TT 12345'),
 (1, 'John', 'Audi R8', 'QQ 23897')]

# Exercises
## Exercise 1
Write an SQL query using a join that produces the following result (the order of the rows is not important).

```
    Name            Car    License
    John    Ford Escort   AB 12345
 Michael    Ford Escort   CD 98765
    John    Porsche 911   QW 13578
    Jane  Fiat Multipla   MORS DYT
     Pat    VW Golf GTI   AA 99999
   Jason        VW Polo  BB 748723
   Scott    Opel Kadett   TT 12345
    John        Audi R8   QQ 23897
```

In [52]:
# Your query here (the cursor is called c)
c.execute('SELECT name, car, license FROM cars JOIN people on people.id = cars.people_id')
print(pandas.DataFrame(c.fetchall(), columns=['Name', 'Car', 'License']).to_string(index=False))

Name            Car   License
   John    Ford Escort  AB 12345
Michael    Ford Escort  CD 98765
   John    Porsche 911  QW 13578
   Jane  Fiat Multipla  MORS DYT
    Pat    VW Golf GTI  AA 99999
  Jason        VW Polo  BB 74873
  Scott    Opel Kadett  TT 12345
   John        Audi R8  QQ 23897

## Exercise 2
Write an SQL query using a join that produces the following result (the order of the rows is not important).

```
    Name            Car    License
    John    Ford Escort   AB 12345
    John    Porsche 911   QW 13578
     Pat    VW Golf GTI   AA 99999
 Michael    Ford Escort   CD 98765
   Scott    Opel Kadett   TT 12345
   Jason        VW Polo  BB 748723
    Jane  Fiat Multipla   MORS DYT
 Miranda
    John        Audi R8   QQ 23897
   Simon
```

In [57]:
c.execute('SELECT name, car, license from cars JOIN people on people.id = cars.people_id GROUP BY name')
print(pandas.DataFrame(c.fetchall(), columns=['Name', 'Car', 'License']).to_string(index=False))

Name            Car   License
   Jane  Fiat Multipla  MORS DYT
  Jason        VW Polo  BB 74873
   John    Ford Escort  AB 12345
Michael    Ford Escort  CD 98765
    Pat    VW Golf GTI  AA 99999
  Scott    Opel Kadett  TT 12345

## Exercise 3
Write an SQL query using a join that produces the following result (the order of the rows is not important).

```
    Name   Car License
 Miranda
   Simon
```

In [11]:
# Your query here

## Exercise 4
Write an SQL query using a join that produces the following result (the order of the rows is not important).

```
     Car   License
Mercedes   ZZ 76345
```

In [ ]:
# Your query here